.experiment-data/correlation-fio-randread-cores1.fio0.txt
test: (g=0): rw=randread, bs=(R) 8192KiB-8192KiB, (W) 8192KiB-8192KiB, (T) 8192KiB-8192KiB, ioengine=libaio, iodepth=64
fio-3.28
Starting 1 process

test: (groupid=0, jobs=1): err= 0: pid=23801: Mon Sep 14 05:18:28 2026
  read: IOPS=780, BW=6243MiB/s (6546MB/s)(1647GiB/270082msec)
    slat (usec): min=147, max=2272, avg=188.49, stdev=46.25
    clat (msec): min=14, max=160, avg=81.81, stdev= 1.36
     lat (msec): min=14, max=160, avg=81.99, stdev= 1.36
    clat percentiles (msec):
     |  1.00th=[   82],  5.00th=[   82], 10.00th=[   82], 20.00th=[   82],
     | 30.00th=[   82], 40.00th=[   82], 50.00th=[   82], 60.00th=[   83],
     | 70.00th=[   83], 80.00th=[   83], 90.00th=[   83], 95.00th=[   83],
     | 99.00th=[   83], 99.50th=[   84], 99.90th=[   84], 99.95th=[   84],
     | 99.99th=[  136]
   bw (  MiB/s): min= 5632, max= 6288, per=100.00%, avg=6246.09, stdev=29.40, samples=539
   iops        : min=  704, max=  786, avg=780.76, stdev= 3.68, samples=539
  lat (msec)   : 20=0.01%, 50=0.02%, 100=99.94%, 250=0.03%
  cpu          : usr=0.12%, sys=15.56%, ctx=210783, majf=0, minf=131083
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued rwts: total=210757,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=64

Run status group 0 (all jobs):
   READ: bw=6243MiB/s (6546MB/s), 6243MiB/s-6243MiB/s (6546MB/s-6546MB/s), io=1647GiB (1768GB), run=270082-270082msec

Disk stats (read/write):
  nvme0n1: ios=2079841/0, merge=134971/0, ticks=168908235/0, in_queue=168908236, util=100.00%