.experiment-data/correlation-fio-randread-cores1.fio0.txt
test: (g=0): rw=randread, bs=(R) 8192KiB-8192KiB, (W) 8192KiB-8192KiB, (T) 8192KiB-8192KiB, ioengine=libaio, iodepth=64
fio-3.28
Starting 1 process

test: (groupid=0, jobs=1): err= 0: pid=16306: Mon Sep 14 04:13:16 2026
  read: IOPS=832, BW=6657MiB/s (6981MB/s)(293GiB/45077msec)
    slat (usec): min=147, max=2229, avg=177.52, stdev=77.96
    clat (msec): min=13, max=151, avg=76.62, stdev= 2.95
     lat (msec): min=13, max=151, avg=76.79, stdev= 2.94
    clat percentiles (msec):
     |  1.00th=[   77],  5.00th=[   77], 10.00th=[   77], 20.00th=[   77],
     | 30.00th=[   77], 40.00th=[   77], 50.00th=[   78], 60.00th=[   78],
     | 70.00th=[   78], 80.00th=[   78], 90.00th=[   78], 95.00th=[   78],
     | 99.00th=[   79], 99.50th=[   79], 99.90th=[  114], 99.95th=[  130],
     | 99.99th=[  148]
   bw (  MiB/s): min= 5984, max= 6688, per=100.00%, avg=6657.60, stdev=80.13, samples=90
   iops        : min=  748, max=  836, avg=832.20, stdev=10.02, samples=90
  lat (msec)   : 20=0.06%, 50=0.13%, 100=99.66%, 250=0.15%
  cpu          : usr=0.11%, sys=16.12%, ctx=37454, majf=0, minf=131082
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=99.8%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued rwts: total=37512,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=64

Run status group 0 (all jobs):
   READ: bw=6657MiB/s (6981MB/s), 6657MiB/s-6657MiB/s (6981MB/s-6981MB/s), io=293GiB (315GB), run=45077-45077msec

Disk stats (read/write):
  nvme0n1: ios=312351/0, merge=23985/0, ticks=23720518/0, in_queue=23720518, util=99.84%