.experiment-data/correlation-fio-randwrite-cores1.fio0.txt
test: (g=0): rw=randwrite, bs=(R) 8192KiB-8192KiB, (W) 8192KiB-8192KiB, (T) 8192KiB-8192KiB, ioengine=libaio, iodepth=64
fio-3.28
Starting 1 process

test: (groupid=0, jobs=1): err= 0: pid=17089: Mon Sep 14 04:14:21 2026
  write: IOPS=180, BW=1441MiB/s (1511MB/s)(63.8GiB/45355msec); 0 zone resets
    slat (usec): min=85, max=280, avg=110.52, stdev=23.92
    clat (msec): min=9, max=699, avg=355.14, stdev=27.52
     lat (msec): min=9, max=700, avg=355.25, stdev=27.51
    clat percentiles (msec):
     |  1.00th=[  338],  5.00th=[  347], 10.00th=[  351], 20.00th=[  355],
     | 30.00th=[  355], 40.00th=[  355], 50.00th=[  355], 60.00th=[  355],
     | 70.00th=[  355], 80.00th=[  355], 90.00th=[  355], 95.00th=[  355],
     | 99.00th=[  451], 99.50th=[  514], 99.90th=[  659], 99.95th=[  676],
     | 99.99th=[  701]
   bw (  MiB/s): min= 1408, max= 1456, per=100.00%, avg=1441.07, stdev= 5.78, samples=90
   iops        : min=  176, max=  182, avg=180.13, stdev= 0.72, samples=90
  lat (msec)   : 10=0.01%, 20=0.02%, 50=0.07%, 100=0.11%, 250=0.34%
  lat (msec)   : 500=98.90%, 750=0.54%
  cpu          : usr=0.59%, sys=1.66%, ctx=8141, majf=0, minf=12
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.2%, 32=0.4%, >=64=99.2%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued rwts: total=0,8169,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=64

Run status group 0 (all jobs):
  WRITE: bw=1441MiB/s (1511MB/s), 1441MiB/s-1441MiB/s (1511MB/s-1511MB/s), io=63.8GiB (68.5GB), run=45355-45355msec

Disk stats (read/write):
  nvme0n1: ios=46/67882, merge=0/5486, ticks=4/23841573, in_queue=23841578, util=99.20%