.experiment-data/icl-stream-fio-read-cores1.fio1.txt
test: (g=0): rw=randread, bs=(R) 8192KiB-8192KiB, (W) 8192KiB-8192KiB, (T) 8192KiB-8192KiB, ioengine=libaio, iodepth=64
fio-3.28
Starting 1 process

test: (groupid=0, jobs=1): err= 0: pid=34182: Tue Sep  8 18:10:59 2026
  read: IOPS=836, BW=6690MiB/s (7015MB/s)(915GiB/140077msec)
    slat (usec): min=163, max=2827, avg=180.87, stdev=58.91
    clat (msec): min=15, max=168, avg=76.30, stdev= 1.87
     lat (msec): min=15, max=170, avg=76.48, stdev= 1.88
    clat percentiles (msec):
     |  1.00th=[   75],  5.00th=[   77], 10.00th=[   77], 20.00th=[   77],
     | 30.00th=[   77], 40.00th=[   77], 50.00th=[   77], 60.00th=[   77],
     | 70.00th=[   77], 80.00th=[   78], 90.00th=[   78], 95.00th=[   78],
     | 99.00th=[   78], 99.50th=[   78], 99.90th=[   79], 99.95th=[  111],
     | 99.99th=[  148]
   bw (  MiB/s): min= 5408, max= 6736, per=100.00%, avg=6695.00, stdev=78.39, samples=279
   iops        : min=  676, max=  842, avg=836.87, stdev= 9.80, samples=279
  lat (msec)   : 20=0.02%, 50=0.04%, 100=99.88%, 250=0.06%
  cpu          : usr=0.21%, sys=18.79%, ctx=117085, majf=0, minf=131081
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=99.9%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued rwts: total=117139,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=64

Run status group 0 (all jobs):
   READ: bw=6690MiB/s (7015MB/s), 6690MiB/s-6690MiB/s (7015MB/s-7015MB/s), io=915GiB (983GB), run=140077-140077msec

Disk stats (read/write):
  nvme1n1: ios=835332/0, merge=0/0, ticks=63273545/0, in_queue=63273545, util=100.00%