.experiment-data/icl-stream-fio-read-cores12.fio0.txt
test: (g=0): rw=randread, bs=(R) 8192KiB-8192KiB, (W) 8192KiB-8192KiB, (T) 8192KiB-8192KiB, ioengine=libaio, iodepth=64
fio-3.28
Starting 1 process

test: (groupid=0, jobs=1): err= 0: pid=37633: Tue Sep  8 18:20:23 2026
  read: IOPS=837, BW=6698MiB/s (7024MB/s)(916GiB/140078msec)
    slat (usec): min=189, max=21162, avg=266.63, stdev=274.70
    clat (msec): min=31, max=526, avg=76.04, stdev= 6.45
     lat (msec): min=31, max=530, avg=76.30, stdev= 6.59
    clat percentiles (msec):
     |  1.00th=[   75],  5.00th=[   75], 10.00th=[   75], 20.00th=[   77],
     | 30.00th=[   77], 40.00th=[   77], 50.00th=[   77], 60.00th=[   77],
     | 70.00th=[   77], 80.00th=[   77], 90.00th=[   77], 95.00th=[   78],
     | 99.00th=[   78], 99.50th=[   78], 99.90th=[   88], 99.95th=[  144],
     | 99.99th=[  468]
   bw (  MiB/s): min= 6672, max= 7344, per=100.00%, avg=6729.21, stdev=40.79, samples=278
   iops        : min=  834, max=  918, avg=841.15, stdev= 5.10, samples=278
  lat (msec)   : 50=0.07%, 100=99.85%, 250=0.05%, 500=0.03%, 750=0.01%
  cpu          : usr=0.35%, sys=22.30%, ctx=136077, majf=0, minf=131081
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=99.9%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued rwts: total=117283,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=64

Run status group 0 (all jobs):
   READ: bw=6698MiB/s (7024MB/s), 6698MiB/s-6698MiB/s (7024MB/s-7024MB/s), io=916GiB (984GB), run=140078-140078msec

Disk stats (read/write):
  nvme0n1: ios=819935/0, merge=0/0, ticks=61736594/0, in_queue=61736594, util=99.84%